{
    "levels": [
    {
        "id": 0,
        "name": "Level 0",
        "url": "ctf0",
        "discription": ["Let's start easy!", "The password for the next level is in a file named \"-\". Just read the password and login to the next level using ssh, the username ctf1, the given IP (or localhost) and the password you just found.", "The \"ls\" command is a good start. This will probably be you're most used command."],
        "tools": ["ls", "ssh" , "cat", "more", "less"],
        "tipps": ["If there is a warning about authentifcation you just need to write yes. Xauthority warning can be ignored too.","Spacial filename characters must be escaped.", "Syntax for ssh: ssh [options] user@ip", "To show everything use ls -la."],
        "link": "non"
    },
    {
        "id": 1,
        "name": "Level 1",
        "url": "ctf1",
        "discription": ["You need to find the password for level 2.", "The password is somewhere on the drive. The file is over 20MB and has lots of other usernames and passwords in it.", "To solve this you should use the find command. Look at man find to specify the search. Once the file is found you have to search for ctf2 within the file. Use an text editor or combine terminal tools like \"cat\" and \"grep\"."],
        "tools": ["cat", "find", "vim", "nano", "grep"],
        "tipps":  ["The file is owned by ctf1", "The file has ctf2 in it.","It is called passwords.txt"],
        "link": "non"
    },
    {
        "id": 2,
        "name": "Level 2",
        "url": "ctf2",
        "discription": ["Again?", "The password file directly in front of you?", "Not quite!", "Information comes in a variety of forms. Not all are human readable. Some are hidden or encoded so its harder to steal these.", "Maybe, but just maybe this is the purpose of this level 🤔"],
        "tools": ["pipes", "hexdump", "strings", "file", "xxd", "cat" , "base64"],
        "tipps": ["The file is in a binary format but cat still can read it.","The file is in a different encoding base64.", "Use an online converter or the terminal"],
        "link": "non"
    },
    {
        "id": 3,
        "name": "Level 3",
        "url": "ctf3",
        "discription": ["Oh, that's kind. The program just gives you the password for the next level. But I think it wants a PIN." ,"Just play around with the program. There are a several ways to complete this level.", "Just to let you know: The PIN is four digits long. You can try all combinations but I would automate this. There are multiple ways to do this. Look at General Tipps for some bash info or klick below."],
        "tools": ["python", "bash", "nano", "emacs", "vim", "chmod", "ltrace", "gdb"],
        "tipps": ["Get into bash scripts", "Example: #!/bin/bash echo \"Hallo World\" ", "A for loop might be a good idea", "To call the programm use: \"./PW-Safe \"-s\" \"ctf4\" $i\" where i is a number"],
        "link": "/example1"
    },
    {
        "id": 4,
        "name": "Level 4",
        "url": "ctf4",
        "discription": ["In this level the password was deleted!", "But almost nothing that's deleted is gone forever right? At least not in IT.", "Extract the archive and look around this level and figure out how a development team keeps track of who did what and what happens when someone deletes something.", "If you are stuck or boared you can just try to start the game. You just need to compile it. Then go to the build folder and start SpaceShooter.", "If you need help \"man\" is you a friend just like google."],
        "tools": ["ls", "tar", "gzip", "git", "cmake"],
        "tipps": ["Use ssh -X for grafics forwarding.","There are several development trees in this reposotory", "Git has lots of other commands and a build in help", "You should try git [log, checkout, show]", "Go back in time/history", "Use make_build.sh for the programm"],
        "link": "non"
    },
    {
        "id": 5,
        "name": "Level 5",
        "url": "ctf5",
        "discription": ["Seems like someone doesn't want to let you in. Or more like he kicks you out!", "How to do something when you are immediately logged off? That's the puzzle for now.", "Other than that there is nothing really new. The owner encoded his file to prevent people from using grep to find sensitive information with words like \"password\" or \"ctf\"."],
        "tools": ["ssh", "base32", "base64", "xxd"],
        "tipps": ["Just read manpages of ssh"],
        "link": "non"
    },
    {
        "id": 6,
        "name": "Level 6",
        "url": "ctf6",
        "discription": ["Something new this time!", "There is no need for a black, text only terminal windows this time. Instead you get to open a browser windows and view an \"beautiful\" website.", "To access the level you first have to login as user ctf6 and the associated password Use the top right button for this.","If you logedin click he link below. Now just look around for a little and you will find what you are looking for." ],
        "tools": ["Browser"],
        "tipps": ["Ever heard of DevTools?", "Press F12"],
        "link": "/ctf/ctf6"
    },
    {
        "id": 7,
        "name": "Level 7",
        "url": "ctf7",
        "discription": ["A website again. You will get used to it. There are some more.", "Login as ctf7. Then you need to find the password for level 8 but only ctf8 has access to it. This seems impossible!", "Or can you trick me to make me think you are ctf8."],
        "tools": ["Browser"],
        "tipps": ["Like last time.", "Shhhh! There are some good browser extentions.", "I really like cookies", "What is the opposite of 0 in IT?"],
        "link": "/ctf/ctf7"
    },
    {
        "id": 8,
        "name": "Level 8",
        "url": "ctf8",
        "discription": ["Login as ctf8 and click on the link below.", "Ohhh! Always these iPhone exclusive apps and websites 🙄", "But how does the server know your device?.", "When you are on an iPhone you better read quick. The site automatically closes after 1 second."],
        "tools": ["Browser", "Postman", "Browser-Addons"],
        "tipps": ["How does the server know that you are not on an IPhone", "What is a user-agent?", "To get the page you can also use the terminal or Postman. There is an example on the Tipps site.", "Postman is a GUI tool if you are on a remote system you need a working X-Server or install it on your local pc","Disable javascript."],
        "link": "/ctf/ctf8"
    },
    {
        "id": 9,
        "name": "Level 9",
        "url": "ctf9",
        "discription": ["I think you have to enter a PIN to get access to the next password.", "I know you already cracked a local program with a pin. Now it's the same on the website.", "Figure out how to send requests to a web page using a local script. Python might be helpful. You can look at /example2 on this page."],
        "tools": ["Browser", "Postman", "Python", "Python-reqests", "Python-bs4", "python3-selenium"],
        "tipps": ["In python use the requests' library.", "To access the page you have to login. So the request also have to authenticate.", "Use cookies = {'Auth': KEY} and append it to your request. Use the data attribute of request and put your numbers in the \"text\" form."],
        "link": "/ctf/ctf9"
    },
    {
        "id": 10,
        "name": "Level 10",
        "url": "ctf10",
        "discription": ["Nice an input form!", "I'm supposed to enter a user name.", "I don't know about you but I hate it when someone tells me what I'm supposed to do. Always do the opposite."],
        "tools": ["Browser", "Postman"],
        "tipps": ["Where are usernames stored?", "This thing, it's called Database.", "And they have there own language.", "Press 12. The relevant table is called Data"],
        "link": "/ctf/ctf10"
    },
    {
        "id": 11,
        "name": "Level 11",
        "url": "ctf11",
        "discription": ["Same as last time but harder. Definitely harder. So take your time and stay motivated.", "Now the input gets filtered for special characters.", "You also don't get direct access to the query result. You only get binary answers. Yes or No. But that's enough to get the password. You can reuse your script from level 9 and extend it."],
        "tools": ["Browser", "Postman", "Python", "Python-reqests", "Python-bs4", "python3-selenium"],
        "tipps": ["Think about SQL injections ans special characters.", "Combine the last two levels.", "First ask the DB what characters are in the query. There are only lowercase, uppercase and numbers in the password. Remember the password is 32 characters long.", "If you know witch characters are in the password you can start building parts of the password. Start with one character, if the answer is true append the next character, else use another character. And so on.", "Use \"and pw LIKE BINARY \"%' + YOURCHAR + '%\" #\" to ask if YOURCHAR is in the password."],
        "link": "/ctf/ctf11"
    },
    {
        "id": 12,
        "name": "Level 12",
        "url": "ctf12",
        "discription": ["Back to the terminal.", "There is an executable in your home directory. Start it, give it a port and say \"hello\" over the network.", "You should try a free port with a high number like 8217."],
        "tools": ["nc" , "ncat", "namp"],
        "tipps": ["nc the swiss army knife of networking", "I think you should listen"],
        "link": "non"
    },
    {
        "id": 13,
        "name": "Level 13",
        "url": "ctf13",
        "discription": ["It's time to crack!", "Now literary. There is a zip file. You can try to open it but you will not get far.", "Luckily \"john\" will save you.", "First you will need to extract the password hash out of the zip files. The tools for this is in the john folder. Next use john to crack the zip.", "You have several wordlists. I recommend you to try it without a wordlist and after that witth different wordlists. "],
        "tools": ["john", "zip", "less"],
        "tipps": ["To extract it use zip2john", "Specify the wordlist with --wordlist=FILE"],
        "link": "non"
    },
    {
        "id": 14,
        "name": "Level 14",
        "url": "ctf14",
        "discription": ["This time there is no password. Only a picture", "Did you ever hear of steganography? It's a technique to hide files in other files. Use \"steghide\" and see what you find. The password for the extraction is the name of this system", "You will see that the file you found is not a password file. In fact it's a key, a ssh-key.", "To use the key you have to change its permission with chmod so that only you can read the file."],
        "tools": ["stegahide", "ls", "ssh", "chmod"],
        "tipps": ["Use man to see the options of \"steghide\"","Use hostname to find the name of the system" ],
        "link": "non"
    },
    {
        "id": 15,
        "name": "Level 15",
        "url": "ctf15",
        "discription": ["This is very similar to level 12.", "But this time you don't have to start the server. It's already running.", "But this time you don't know the port the server is running on. Good luck trying all 65535 ports.", "It is very important to know the running services and open ports on your system. A way to find them is with nmap. It's one of the best network scanners out there and is used by admins and attackers to find open ports and the services on a system. Now you have to scan this local PC. Then you just connect to the port with nc like in level 12."],
        "tools": ["nmap", "nc", "ncat"],
        "tipps": ["nmap has a good man page", "Don't just scan the most used ports, scan everything"],
        "link": "non"
    },
    {
        "id": 16,
        "name": "Level 16",
        "url": "ctf16",
        "discription": [""],
        "tools": ["non"],
        "tipps": [""],
        "link": "non"
    },
    {
        "id": 17,
        "name": "Level 17",
        "url": "ctf17",
        "discription": [""],
        "tools": ["non"],
        "tipps": [""],
        "link": "non"
    },
    {
        "id": 18,
        "name": "Level 18",
        "url": "ctf18",
        "discription": [""],
        "tools": ["non"],
        "tipps": [""],
        "link": "non"
    },
    {
        "id": 19,
        "name": "Level 19",
        "url": "ctf19",
        "discription": [""],
        "tools": ["non"],
        "tipps": [""],
        "link": "non"
    },
    {
        "id": 20,
        "name": "Level 20",
        "url": "ctf20",
        "discription": [""],
        "tools": ["non"],
        "tipps": [""],
        "link": "non"
    }]
}